      * FILE VIDEO ESEMPIO PER DEFINIZIONE CAMPI CON REFERENCE FIELD
      * (c) MarkOneTools - www.markonetools.it - 2023
      *
      * ATTENTION!!!
      * Packed decimal and binary fields are not supported for display files
      * when you refer to fields of these types, the data type assigned is zoned decimal

     A*                                      DSPSIZ(27 132 *DS4)
     A                                      REF(DATATYPE)
     A          R FMT01
      * char 10
     A            W_CHAR    R        H      REFFLD(F_CHAR)
      * ==> char 10
     A            W_VARCHAR R        H      REFFLD(F_VARCHAR)
      * ==> zoned 5,2
     A            W_DEC     R        H      REFFLD(F_DEC)
      * zoned 5,2
     A            W_NUM     R        H      REFFLD(F_NUM)
      * ==> zoned 4,0
     A            W_SMALLINTR        H      REFFLD(F_SMALLINT)
      * ==> zoned 9,0
     A            W_INT     R        H      REFFLD(F_INT)
      * ==> zoned 18,0
     A            W_BIGINT  R        H      REFFLD(F_BIGINT)
      * date 10
     A            W_DATE    R        H      REFFLD(F_DATE)
      * time 8
     A            W_TIME    R        H      REFFLD(F_TIME)
      * timestamp 26,6
     A            W_TIMESTMPR        H      REFFLD(F_TIMESTMP)
      * ==> date !!! what?
     A            W_BOOLEAN R        H      REFFLD(F_BOOLEAN)
      * NO CPD5702
     A*           W_ROWID   R        H      REFFLD(F_ROWID)
      *
      * WITH ADJUSTEMENT
      * ==> zoned 5,0
     A            W2SMALLINTR   +1   H      REFFLD(F_SMALLINT)
      * ==> zoned 10,0
     A            W2INT     R   +1   H      REFFLD(F_INT)
      * ==> zoned 20,0
     A            W2BIGINT  R   +2   H      REFFLD(F_BIGINT)